In [1]:
import pandas as pd

In [37]:
user   = pd.read_csv('/home/tione/notebook/data/train_preliminary/user.csv')
user

        user_id  age  gender
0             1    4       1
1             2   10       1
2             3    7       2
3             4    5       1
4             5    4       1
...         ...  ...     ...
899995   899996    5       1
899996   899997    3       2
899997   899998    4       2
899998   899999    3       1
899999   900000    3       2

[900000 rows x 3 columns]

In [38]:
user['user_id'].value_counts()

2047     1
63818    1
341      1
2388     1
12627    1
        ..
16045    1
13996    1
3755     1
1706     1
2049     1
Name: user_id, Length: 900000, dtype: int64

In [39]:
ad     = pd.read_csv('/home/tione/notebook/data/train_preliminary/ad.csv')

In [4]:
click  = pd.read_csv('/home/tione/notebook/data/train_preliminary/click_log.csv')

In [5]:
click

          time  user_id  creative_id  click_times
0            9    30920       567330            1
1           65    30920      3072255            1
2           56    30920      2361327            1
3            6   309204       325532            1
4           59   309204      2746730            1
...        ...      ...          ...          ...
30082766     6    30920       228129            1
30082767    57    30920      2361397            1
30082768    26    30920       629802            1
30082769    86    30920      2713031            1
30082770    25    30920       629802            1

[30082771 rows x 4 columns]

In [9]:
# found user have less click data
click_counts =  click['user_id'].value_counts()

In [10]:
click_counts

839368    16868
157585     1706
677301     1661
178333     1321
549175     1273
          ...
196804        3
697730        3
306941        3
229147        3
592868        2
Name: user_id, Length: 900000, dtype: int64

In [31]:
filtered = click_counts[click_counts <= 10]  #总数 900000 , 50000相对占比 5% 多一点，感觉提升空间会非常有限 先尝试下，这部分直接统计结果预测

In [32]:
filtered['user_id'].value_counts()

336327    10
337131    10
663591    10
681937    10
590614    10
          ..
196804     3
697730     3
306941     3
229147     3
592868     2
Name: user_id, Length: 50058, dtype: int64

In [33]:
filtered_click = click[click['user_id'].isin(filtered.index)]

In [34]:
filtered_click

          time  user_id  creative_id  click_times
681         91   309237      3904195            1
682          7   309237       230303            1
683         90   309237      4006201            1
684         47   309237      1779097            2
685         89   309237      3562358            1
...        ...      ...          ...          ...
30082618    81   309194      3938372            1
30082619    26   309194        21852            1
30082620    17   309194       279345            1
30082621    85   309194      3861909            1
30082622    17   309194         2049            1

[483211 rows x 4 columns]

In [35]:
filtered_click['creative_id'].value_counts()

37298      2413
32571      1671
12838      1430
69204      1238
37295      1113
           ...
4053707       1
698568        1
3330247       1
1116348       1
2049          1
Name: creative_id, Length: 176538, dtype: int64

In [22]:
filtered_click_user = filtered_click.join(user.set_index('user_id'), on='user_id')

In [23]:
filtered_click_user  # 这里按照集合的方式来计算每个用户的相似度，最后取top10的用户，以投票的方式得到用户性别和年龄

          time  user_id  creative_id  click_times  age  gender
681         91   309237      3904195            1    2       2
682          7   309237       230303            1    2       2
683         90   309237      4006201            1    2       2
684         47   309237      1779097            2    2       2
685         89   309237      3562358            1    2       2
...        ...      ...          ...          ...  ...     ...
30082618    81   309194      3938372            1    6       1
30082619    26   309194        21852            1    6       1
30082620    17   309194       279345            1    6       1
30082621    85   309194      3861909            1    6       1
30082622    17   309194         2049            1    6       1

[483211 rows x 6 columns]

In [ ]:
filtered_click_user

In [24]:
test_click = pd.read_csv('/home/tione/notebook/data/test/click_log.csv')

In [30]:
test_click_counts =  test_click['user_id'].value_counts() 
test_click_counts

3648518    113974
3834944     26609
3093561     25506
3206914     18178
3522917     11116
            ...
3596607         3
3020039         3
3017393         3
3900282         2
3707547         2
Name: user_id, Length: 1000000, dtype: int64

In [28]:
filtered_test = test_click_counts[test_click_counts <= 10]

In [36]:
filtered_test  #这里用户也只有5W，相当于5%

3093753    10
3668814    10
3158715    10
3917403    10
3537648    10
           ..
3596607     3
3020039     3
3017393     3
3900282     2
3707547     2
Name: user_id, Length: 55847, dtype: int64